app/views/tasks/_task.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 3]]
---
  <table class='table table-hover' id=<%= "task_view_#{project.id}" %> >
    <%- project.tasks.each do |task| %>