app/controllers/projects_controller.rb

  def index
    @projects = current_user.projects.all
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]

  def create
    @project = current_user.projects.create(project_params)
---
INSERT INTO "projects" ("project_name", "user_id") VALUES (?, ?)  [["project_name", "new project"], ["user_id", 1]]

  def update
    @project = Project.find(params[:id])
    if @project.update(project_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "projects" SET "project_name" = ? WHERE "projects"."id" = ?  [["project_name", "new project 2!!"], ["id", 3]]

  def destroy
    Project.find(params[:id]).destroy
---
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]