app/controllers/tasks_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "tasks" ("task_name", "project_id") VALUES (?, ?)  [["task_name", "milk"], ["project_id", 3]]
---
  def create
	  @project =Project.find(params[:project_id])
    @tasks = @project.tasks
    @task = @project.tasks.create(tasks_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 3], ["id", 3], ["LIMIT", 1]]
---
  def edit
    @project = Project.find(params[:project_id])
    @task = @project.tasks.find(params[:id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 11], ["id", 19], ["LIMIT", 1]]
UPDATE "tasks" SET "task_name" = ? WHERE "tasks"."id" = ?  [["task_name", "xxxa"], ["id", 5]]
---
  def update
    @project =Project.find(params[:project_id])
    @tasks = @project.tasks
    @task = @project.tasks.find(params[:id])
    @task.update(tasks_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 3], ["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
  def destroy
    @project = Project.find(params[:project_id])
    @tasks = @project.tasks
    @task = @project.tasks.find(params[:id])
    @task.destroy